<a href="https://colab.research.google.com/github/Sairam-04/ML-Packages/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas:

Pandas is an open-source, BSD-licensed Python library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. Python with Pandas is used in a wide range of fields including academic and commercial domains including finance, economics, Statistics, analytics, etc. In this tutorial, we will learn the various features of Python Pandas and how to use them in practice.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#Creating Dataframe
data = np.arange(0,20).reshape(5,4)
df = pd.DataFrame(data, index = ['Row1','Row2','Row3','Row4','Row5'], columns=["Column1","Column2","Column3","Column4"])

In [ ]:
print(df)

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [ ]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [ ]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [ ]:
df.head(2)

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [ ]:
#df.describe()

         Column1    Column2    Column3    Column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [ ]:
# creating csv file
df.to_csv('sample1.csv')

In [ ]:
#Acessing elements
# 1. .loc[]  2. .iloc[]

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int64

In [ ]:
type(df.loc['Row1'])

pandas.core.series.Series

In [ ]:
df[['Column1','Column2']]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [ ]:
df[['Column1','Column2']]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [ ]:
# INdexing
df.loc['Row1']['Column3']

2

In [ ]:
# .iloc[]

df.iloc[0:2,1:2]

      Column2
Row1        1
Row2        5

In [ ]:
df.iloc[1:4,0:2]

      Column1  Column2
Row2        4        5
Row3        8        9
Row4       12       13

In [ ]:
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [ ]:
# If we have more than 1row or 1 col type is data frame

type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [ ]:
df.iloc[0:3,0]

Row1    0
Row2    4
Row3    8
Name: Column1, dtype: int64

In [ ]:
# If we have 1row or 1 col type is series

type(df.iloc[0:3,0])

pandas.core.series.Series

In [ ]:
# Converting DataFrame into an array
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [ ]:
df.iloc[:,:].values.shape

(5, 4)

In [ ]:
# Finding Null values in dataframe
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [ ]:
df.value_counts()

Column1  Column2  Column3  Column4
16       17       18       19         1
12       13       14       15         1
8        9        10       11         1
4        5        6        7          1
0        1        2        3          1
dtype: int64

In [ ]:
df['Column1'].unique() #unique values in dataframe

array([ 0,  4,  8, 12, 16])